patagonaa/isdt-cm1620/RevEng/Ghidra/HDSC_HC32F460_fixed_for_Ghidra.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DBGC</name>
            <description>desc DBGC</description>
            <baseAddress>0xE0042000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x28</size>
            </addressBlock>
            <registers>
                <register>
                    <name>AUTHID0</name>
                    <description>desc AUTHID0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>AUTHID1</name>
                    <description>desc AUTHID1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>AUTHID2</name>
                    <description>desc AUTHID2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>RESV0</name>
                    <description>desc RESV0</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>MCUSTAT</name>
                    <description>desc MCUSTAT</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x30F</resetMask>
                    <fields>
                        <field>
                            <name>AUTH</name>
                            <description>desc AUTH</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REMVLOCK</name>
                            <description>desc REMVLOCK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAFTYLOCK1</name>
                            <description>desc SAFTYLOCK1</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAFTYLOCK2</name>
                            <description>desc SAFTYLOCK2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPUSTOP</name>
                            <description>desc CPUSTOP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPUSLEEP</name>
                            <description>desc CPUSLEEP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUCTL</name>
                    <description>desc MCUCTL</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x103</resetMask>
                    <fields>
                        <field>
                            <name>EDBGRQ</name>
                            <description>desc EDBGRQ</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESTART</name>
                            <description>desc RESTART</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIRQ</name>
                            <description>desc DIRQ</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FMCCTL</name>
                    <description>desc FMCCTL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>ERASEREQ</name>
                            <description>desc ERASEREQ</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERASEACK</name>
                            <description>desc ERASEACK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERASEERR</name>
                            <description>desc ERASEERR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUDBGSTAT</name>
                    <description>desc MCUDBGSTAT</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>CDBGPWRUPREQ</name>
                            <description>desc CDBGPWRUPREQ</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CDBGPWRUPACK</name>
                            <description>desc CDBGPWRUPACK</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUSTPCTL</name>
                    <description>desc MCUSTPCTL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0xFFF0C03F</resetMask>
                    <fields>
                        <field>
                            <name>SWDTSTP</name>
                            <description>desc SWDTSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDTSTP</name>
                            <description>desc WDTSTP</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCSTP</name>
                            <description>desc RTCSTP</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD0STP</name>
                            <description>desc PVD0STP</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1STP</name>
                            <description>desc PVD1STP</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2STP</name>
                            <description>desc PVD2STP</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR01STP</name>
                            <description>desc TMR01STP</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR02STP</name>
                            <description>desc TMR02STP</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR41STP</name>
                            <description>desc TMR41STP</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR42STP</name>
                            <description>desc TMR42STP</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR43STP</name>
                            <description>desc TMR43STP</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TM61STP</name>
                            <description>desc TM61STP</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TM62STP</name>
                            <description>desc TM62STP</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMR63STP</name>
                            <description>desc TMR63STP</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA1STP</name>
                            <description>desc TMRA1STP</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA2STP</name>
                            <description>desc TMRA2STP</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA3STP</name>
                            <description>desc TMRA3STP</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA4STP</name>
                            <description>desc TMRA4STP</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA5STP</name>
                            <description>desc TMRA5STP</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMRA6STP</name>
                            <description>desc TMRA6STP</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCUTRACECTL</name>
                    <description>desc MCUTRACECTL</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>TRACEMODE</name>
                            <description>desc TRACEMODE</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRACEIOEN</name>
                            <description>desc TRACEIOEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
