patagonaa/isdt-cm1620/RevEng/Ghidra/HDSC_HC32F460_fixed_for_Ghidra.svd
                <register>
                    <name>GINTMSK</name>
                    <description>desc GINTMSK</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF77CFCFA</resetMask>
                    <fields>
                        <field>
                            <name>MMISM</name>
                            <description>desc MMISM</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOFM</name>
                            <description>desc SOFM</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RXFNEM</name>
                            <description>desc RXFNEM</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NPTXFEM</name>
                            <description>desc NPTXFEM</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINAKEFFM</name>
                            <description>desc GINAKEFFM</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GONAKEFFM</name>
                            <description>desc GONAKEFFM</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ESUSPM</name>
                            <description>desc ESUSPM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBSUSPM</name>
                            <description>desc USBSUSPM</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBRSTM</name>
                            <description>desc USBRSTM</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENUMDNEM</name>
                            <description>desc ENUMDNEM</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISOODRPM</name>
                            <description>desc ISOODRPM</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOPFM</name>
                            <description>desc EOPFM</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IEPIM</name>
                            <description>desc IEPIM</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OEPIM</name>
                            <description>desc OEPIM</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IISOIXFRM</name>
                            <description>desc IISOIXFRM</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IPXFRM_INCOMPISOOUTM</name>
                            <description>desc IPXFRM_INCOMPISOOUTM</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAFSUSPM</name>
                            <description>desc DATAFSUSPM</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HPRTIM</name>
                            <description>desc HPRTIM</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCIM</name>
                            <description>desc HCIM</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTXFEM</name>
                            <description>desc PTXFEM</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CIDSCHGM</name>
                            <description>desc CIDSCHGM</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DISCIM</name>
                            <description>desc DISCIM</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VBUSVIM</name>
                            <description>desc VBUSVIM</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WKUIM</name>
                            <description>desc WKUIM</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRXSTSR</name>
                    <description>desc GRXSTSR</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHNUM_EPNUM</name>
                            <description>desc CHNUM_EPNUM</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BCNT</name>
                            <description>desc BCNT</description>
                            <msb>14</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PKTSTS</name>
                            <description>desc PKTSTS</description>
                            <msb>20</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRXSTSP</name>
                    <description>desc GRXSTSP</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHNUM_EPNUM</name>
                            <description>desc CHNUM_EPNUM</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BCNT</name>
                            <description>desc BCNT</description>
                            <msb>14</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>desc DPID</description>
                            <msb>16</msb>
                            <lsb>15</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PKTSTS</name>
                            <description>desc PKTSTS</description>
                            <msb>20</msb>
                            <lsb>17</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GRXFSIZ</name>
                    <description>desc GRXFSIZ</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x140</resetValue>
                    <resetMask>0x7FF</resetMask>
                    <fields>
                        <field>
                            <name>RXFD</name>
                            <description>desc RXFD</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HNPTXFSIZ</name>
                    <description>desc HNPTXFSIZ</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x2000140</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NPTXFSA</name>
                            <description>desc NPTXFSA</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NPTXFD</name>
                            <description>desc NPTXFD</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HNPTXSTS</name>
                    <description>desc HNPTXSTS</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x80100</resetValue>
                    <resetMask>0x7FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>NPTXFSAV</name>
                            <description>desc NPTXFSAV</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NPTQXSAV</name>
                            <description>desc NPTQXSAV</description>
                            <msb>23</msb>
                            <lsb>16</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NPTXQTOP</name>
                            <description>desc NPTXQTOP</description>
                            <msb>30</msb>
                            <lsb>24</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CID</name>
                    <description>desc CID</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x12345678</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>HPTXFSIZ</name>
                    <description>desc HPTXFSIZ</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1400280</resetValue>
                    <resetMask>0x7FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>PTXSA</name>
                            <description>desc PTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTXFD</name>
                            <description>desc PTXFD</description>
                            <msb>26</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF1</name>
                    <description>desc DIEPTXF1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF2</name>
                    <description>desc DIEPTXF2</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF3</name>
                    <description>desc DIEPTXF3</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF4</name>
                    <description>desc DIEPTXF4</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTXF5</name>
                    <description>desc DIEPTXF5</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1000240</resetValue>
                    <resetMask>0x3FF0FFF</resetMask>
                    <fields>
                        <field>
                            <name>INEPTXSA</name>
                            <description>desc INEPTXSA</description>
                            <msb>11</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INEPTXFD</name>
                            <description>desc INEPTXFD</description>
                            <msb>25</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCFG</name>
                    <description>desc HCFG</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x200000</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>FSLSPCS</name>
                            <description>desc FSLSPCS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSLSS</name>
                            <description>desc FSLSS</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HFIR</name>
                    <description>desc HFIR</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xEA60</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FRIVL</name>
                            <description>desc FRIVL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
